RATINGS_NAMES = [
    "qs_world_university_rankings_2022",
    "times_higher_education_world_university_rankings_2022",
]
# Список университетов в рейтинге QS World University Rankings – 2022
QS_WORLD_UNIVERSITY_RANKINGS_2022 = [
    [
        "Московский государственный университет имени М.В. Ломоносова",
        78,
        1,
    ],
    [
        "Санкт-Петербургский государственный университет",
        242,
        2,
    ],
    [
        "Новосибирский национальный исследовательский государственный" "университет",
        246,
        3,
    ],
    [
        "Национальный исследовательский Томский государственный университет",
        272,
        4,
    ],
    [
        (
            "Московский государственный технический университет им. Н.Э. Баумана"
            " (национальный исследовательский университет)"
        ),
        285,
        5,
    ],
]
# Список университетов в рейтинге
# Times Higher Education World University Rankings – 2022
TIMES_HIGHER_EDUCATION_WORLD_UNIVERSITY_RANKINGS_2022 = [
    [
        "Московский государственный университет имени М.В. Ломоносова",
        158,
        1,
    ],
    [
        "Московский физико-технический институт " "(национальный исследовательский университет)",
        "201-250",
        2,
    ],
    [
        "Национальный исследовательский университет «Высшая школа экономики»",
        "301-350",
        3,
    ],
    [
        "Санкт-Петербургский политехнический университет Петра Великого",
        "301-350",
        3,
    ],
    [
        "Санкт-Петербургский горный университет",
        "401-500",
        4,
    ],
]
