# Список специальностей
UNIVERSITIES = [
    [
        "МИРЭА",
        [
            [
                "Прикладная математика и информатика",
                [
                    ["Русский язык", "Математика", "Информатика и ИКТ"],
                ],
                267,
                87,
                177600,
            ],
            [
                "Прикладная математика",
                [
                    ["Русский язык", "Математика", "Информатика и ИКТ"],
                ],
                259,
                30,
                177600,
            ],
            [
                "Статистика",
                [
                    ["Русский язык", "Математика", "Информатика и ИКТ"],
                ],
                243,
                30,
                160000,
            ],
            [
                "Химия",
                [
                    ["Русский язык", "Математика", "Химия"],
                ],
                223,
                75,
                192000,
            ],
            [
                "Нанотехнологии и микросистемная техника",
                [
                    ["Русский язык", "Математика", "Физика"],
                ],
                212,
                30,
                219200,
            ],
            [
                "Техносферная безопасность",
                [
                    ["Русский язык", "Математика", "Физика"],
                    ["Русский язык", "Математика", "Химия"],
                ],
                190,
                19,
                177600,
            ],
        ],
    ],
    [
        "ВШЭ",
        [
            [
                "Бизнес-информатика",
                [
                    ["Русский язык", "Математика", "Иностранный язык"],
                ],
                297,
                110,
                650000,
            ],
            [
                "Биология",
                [
                    ["Русский язык", "Биология", "Химия"],
                    ["Русский язык", "Биология", "Математика"],
                ],
                294,
                50,
                470000,
            ],
            [
                "География",
                [
                    ["Русский язык", "География", "Информатика и ИКТ"],
                    ["Русский язык", "География", "Математика"],
                ],
                277,
                40,
                450000,
            ],
            [
                "Государственное и муниципальное управление",
                [
                    [
                        "Математика",
                        "Русский язык",
                        "Обществознание",
                        "Иностранный язык",
                    ],
                ],
                363,
                75,
                480000,
            ],
            [
                "Дизайн",
                [
                    [
                        "Литература",
                        "Русский язык",
                        "Вступительные",
                    ],
                ],
                292,
                52,
                620000,
            ],
        ],
    ],
    [
        "МГУ",
        [
            [
                "Астрономия",
                [
                    ["Русский язык", "Математика", "Физика", "Вступительные"],
                ],
                329,
                20,
                435970,
            ],
            [
                "Биоинженерия и биоинформатика",
                [
                    [
                        "Русский язык",
                        "Математика",
                        "Химия",
                        "Биология",
                        "Вступительные",
                    ],
                ],
                476,
                35,
                441440,
            ],
            [
                "Журналистика",
                [
                    [
                        "Русский язык",
                        "Литература",
                        "История",
                        "Вступительные",
                    ],
                    [
                        "Русский язык",
                        "Литература",
                        "Иностранный язык",
                        "Вступительные",
                    ],
                ],
                362,
                170,
                246000,
            ],
        ],
    ],
]
